---
kind: type
id: T:Autodesk.Revit.DB.Mechanical.MEPBuildingConstructionSet
source: html/fbe2c9fe-89ea-fc75-e418-cebc452ca1dd.htm
---
# Autodesk.Revit.DB.Mechanical.MEPBuildingConstructionSet

A set that contains MEPBuildingConstructions.

## Syntax (C#)
```csharp
public class MEPBuildingConstructionSet : APIObject,
	IEnumerable
```